ghsecuritylab/japabox/thirdparty/Kinetis-SDK/boards/frdmk66f/driver_examples/sai/edma_transfer/fsl_dialog7212.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief DA7212 initialize function.
 *
 * @param handle DA7212 handle pointer.
 * @param config Codec configure structure. This parameter can be NULL, if NULL, set as default settings.
 * The default setting:
 * @code
 * sgtl_init_t codec_config
 * codec_config.route = kDA7212_RoutePlayback
 * codec_config.bus = kDA7212_BusI2S
 * codec_config.isMaster = false
 * @endcode
 */
status_t DA7212_Init(codec_handle_t *handle, void *config);

/*!
 * @brief Set DA7212 audio format.
 *
 * @param handle DA7212 handle pointer.
 * @param sampleRate_Hz Sample rate frequency in Hz.
 * @param masterClock_Hz Master clock frequency in Hz. If DA7212 is slave, use the frequency of master, if DA7212 as
 * master, it should be 1228000 while sample rate frequency is 8k/12K/16K/24K/32K/48K/96K, 11289600 whie sample rate is
 * 11.025K/22.05K/44.1K
 * @param dataBits How many bits in a word of a audio frame, DA7212 only supports 16/20/24/32 bits.
 */
status_t DA7212_ConfigAudioFormat(codec_handle_t *handle,
                              uint32_t masterClock_Hz,
                              uint32_t sampleRate_Hz,
                              uint32_t dataBits);

/*!
 * @brief Set DA7212 playback volume.
 *
 * @param handle DA7212 handle pointer.
 * @param volume The volume of playback.
 */
void DA7212_ChangeHPVolume(codec_handle_t *handle, da7212_volume_t volume);

/*!
 * @brief Mute or unmute DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param isMuted True means mute, false means unmute.
 */
void DA7212_Mute(codec_handle_t *handle, bool isMuted);

/*!
 * @brief Set the input data source of DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param DA7212_Input Input data source.
 */
void DA7212_ChangeInput(codec_handle_t *handle, da7212_Input_t DA7212_Input);

/*!
 * @brief Set the output device of DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param DA7212_Output Output device of DA7212.
 */
void DA7212_ChangeOutput(codec_handle_t *handle, da7212_Output_t DA7212_Output);

/*!
 * @brief Write a register for DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param u8Register DA7212 register address to be written.
 * @param u8RegisterData Data to be written into regsiter
 */
status_t DA7212_WriteRegister(codec_handle_t *handle, uint8_t u8Register, uint8_t u8RegisterData);

/*!
 * @brief Get a register value of DA7212.
 *
 * @param handle DA7212 handle pointer.
 * @param u8Register DA7212 register address to be read.
 * @param pu8RegisterData Pointer where the read out value to be stored.
 */
status_t DA7212_ReadRegister(codec_handle_t *handle, uint8_t u8Register, uint8_t *pu8RegisterData);

/*!
 * @brief Deinit DA7212.
 *
 * @param handle DA7212 handle pointer.
 */
status_t DA7212_Deinit(codec_handle_t *handle);

#if defined(__cplusplus)
}
#endif

#endif /* _FSL_DIALOG7212_H_ */
